ThomasQi3141/doom-on-htn-badge/firmware/bringup/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# UART0's pins (GPIO20/21) drive the button shift register, so the only console
# available on this board is the built-in USB Serial/JTAG peripheral.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# Every byte of DRAM matters here; drop the ROM's chattiest consumers.
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
